# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [384, BasicBlock, 2, 5, 'relu']] # 7-P5/32
  - [-1, 1, Blocks, [512, BasicBlock, 2, 6, 'relu']] # 7-P6/64

head:
  - [ -1, 1, Partial_conv3_DWCWTC, [ 128,2 ] ]  # 替换卷积层8  20
  - [ -1, 1, TselfATTENTION,[ 128 ] ]#9 20
  - [ -1, 1, Partial_conv3_DWCWTC, [ 128, 2 ] ]  # 替换卷积层10 20 p1
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 11  40

  - [ 6, 1, Partial_conv3_DWCWTC, [ 128, 2 ] ]  # 替换卷积层 12 40
  - [ 5, 1, Partial_conv3_DWCWTC, [ 128, 2 ] ]  # 替换卷积层 13 80
  - [ 4, 1, Partial_conv3_DWCWTC, [ 128, 2 ] ]  # 替换卷积层 14 160

  - [ [ 13, 12, 10, 13 ], 1, HRAMi, [ 128 ] ]  # 15  80 40 20
  - [ -1, 3, RepC3, [ 128, 0.5] ]    # 16 80  p2

  - [ [ 14, 16, 11 ,14], 1, HRAMi, [ 128 ] ]  # 17  160 80 40
  - [ -1, 3, RepC3, [ 128, 0.5 ] ]    # 18  160  p3

  - [ -1, 1, Conv, [ 128, 3, 2 ] ]   # 19  80
  - [[-1, 16], 1, Concat, [1]]  # 20 cat Y5  40
  - [ -1, 1, Conv, [ 128, 3, 2 ] ]   # 21  40
  - [[-1, 11], 1, Concat, [1]]  # 22 cat Y5  40
  - [ -1, 3, RepC3, [ 128, 0.5 ] ]    # 23   40 p4

  - [ [ 10, 23, 16, 18 ], 1, RTDETRDecoder, [ nc, 128, 300, 4, 8, 3 ] ]  # Detect(P3, P4, P5)

