# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4  160
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8  80
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16  40
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32  20

head:
#  - [-1, 1, SAFM, [512]]  #8 P5/32 20
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 20
  - [-1, 1,AIFI,[1024, 8]]#9  20
  - [-1, 1, SAFM, [256]]  # 10 20

  - [-1, 1, EUCB, [256]] # 11  40
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 20
#  - [6, 1, SAFM, [256]]  # 12  40
  - [[-2, -1], 1, Concat, [1]] # 13  40
  - [-1, 3, RepC3, [256,0.5]] #14 40
  - [-1, 1, SAFM, [256]]  # 15 40

  - [-1, 1, EUCB, [256]] # 16  80
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 20
#  - [5, 1, SAFM, [128]]  #17  80
  - [[-2, -1], 1, Concat, [1]]  # 18 80
  - [-1, 3, RepC3, [256,0.5]] #19 80
  - [-1, 1, SAFM, [256]]  # 20 80

  - [-1, 1, EUCB, [256]] # 21  160
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 20
#  - [4, 1, SAFM, [64]]  #22  160
  - [[-2, -1], 1, Concat, [1]]  # 23 160
  - [-1, 3, RepC3, [256,0.5]]   #24 160 x4

  - [-1, 1, DynamicPartialDownsample, [256]]   # 25  80
  - [[-1, 20], 1, Concat, [1]]  #26 80
  - [-1, 3, RepC3, [256,0.5]]   #27 80 x3

  - [-1, 1, DynamicPartialDownsample, [256]]   #28 40
  - [[-1, 15], 1, Concat, [1]]  #29 40
  - [-1, 3, RepC3, [256,0.5]]  #30 40 x2

  - [-1, 1, DynamicPartialDownsample, [256]]   #31 20
  - [[-1, 10], 1, Concat, [1]]  #32 20
  - [-1, 3, RepC3, [256,0.5]]   #33 20  x1

  - [[24, 27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(x1, x2, x3, x4)