# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [ 4, 1, Conv, [ 256, 3, 2 ] ]   # 8  80
  - [[-1,5], 1, Concat, [1]]#9 80
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 10 80
  - [-1, 3, RepC3, [256, 0.5]]  # 11

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]   # 12  40
  - [[-1,6], 1, Concat, [1]]#13 40
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 14 40
  - [-1, 3, RepC3, [256, 0.5]]  # 15

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]   # 16  20
  - [[-1,7], 1, Concat, [1]]#17 20
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 18 20
  - [-1, 3, RepC3, [256, 0.5]]  # 19
  - [ -1, 1, TselfATTENTION,[ 256 ] ]#20 p1 20

  - [-1, 1, EUCB, [256]] # 21
  - [[-1,13], 1, Concat, [1]]#22 40
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 23 40
  - [-1, 3, RepC3, [256, 0.5]]  # 24 p2 40

  - [-1, 1, EUCB, [256]] # 25
  - [ [ -1,10], 1, Concat, [ 1 ] ]#26 80
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 27 80
  - [-1, 3, RepC3, [256, 0.5]]  # 28 p3 80

  - [-1, 1, DySample, [2, 'lp']] # 29  160
  - [ [ 4,-1 ], 1, Concat, [ 1 ] ]#30 160
  - [-1, 1, CBAM, []]# 31 160 p4

  - [ [ 20, 24, 28, 31 ], 1, RTDETRDecoder, [ nc, 256, 300, 4, 8, 3 ] ]  # Detect(p1 p2 p3 p4)

