# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

head:
  - [ 4, 1, HWD, [256]]  # 替换卷积层8  80
  - [[-1,5], 1, Concat, [1]]#9 80
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 10 80
  - [-1, 1, CBAM, []]# 11 80
#  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0

  - [ -1, 1, HWD, [256]]  # 替换卷积层12  40
  - [[-1,6], 1, Concat, [1]]#13 40
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 14 40
  - [-1, 1, CBAM, []]# 15 40
#  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0

  - [ -1, 1, HWD, [ 256 ]]  # 替换卷积层16  20
  - [[-1,7], 1, Concat, [1]]#17 20
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 18 20
  - [-1, 1, CBAM, []]# 19 20
  - [ -1, 1, TselfATTENTION,[ 256 ] ]#20 p1 20

  - [-1, 1, DySample, [2, 'lp']] # 21  40
  - [[-1,13], 1, Concat, [1]]#22 40
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 23 40
  - [-1, 1, CBAM, []]# 24 40
#  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0

  - [-1, 1, DySample, [2, 'lp']] # 25  80
  - [ [ -1,10], 1, Concat, [ 1 ] ]#26 80
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 27 40
  - [-1, 1, CBAM, []]# 28 80
#  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0

  - [-1, 1, DySample, [2, 'lp']] # 29
  - [4, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 30 40
  - [ -1, 1, TselfATTENTION,[ 256 ] ]#31 20 p1
  - [ [ -3,-1 ], 1, Concat, [ 1 ] ]#32 160
  - [-1, 1, Partial_conv3, [ 256, 2 ] ]  # 替换卷积层 33 40
  - [-1, 1, CBAM, []]# 34 80
#  - [-1, 3, RepC3, [256, 0.5]]  # 14, fpn_blocks.0

  - [ [ 17, 20, 23, 28 ], 1, RTDETRDecoder, [ nc, 256, 300, 4, 8, 3 ] ]  # Detect(P3, P4, P5)

