# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4

  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4 320
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8 160
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16 80
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32 40
  - [-1, 1, Blocks, [512, BasicBlock, 2, 6, 'relu']] # 8-P5/64  20
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 20
  - [-1, 1,TselfATTENTION,[256]]#9 20
  - [-1, 1, Partial_conv3_DWCWTC, [256, 2, 'split_cat']]  # 10 20
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11 40

  - [7, 1, Partial_conv3_DWCWTC, [256, 2, 'split_cat']]  #12 40
  - [[-2, -1], 1, Concat, [1]] # 13 40
  - [-1, 3, RepC3, [256, 0.5]]  # 14 40
  - [-1, 1, Partial_conv3_DWCWTC, [256, 2, 'split_cat']]  #15 40
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16  80

  - [6, 1, Partial_conv3_DWCWTC, [256, 2, 'split_cat']]  # 替换卷积层 17 80
  - [[-2, -1], 1, Concat, [1]]  # 18 80
  - [-1, 3, RepC3, [256, 0.5]]    # 19 80
  - [-1, 1, Partial_conv3_DWCWTC, [256, 2, 'split_cat']]  #20 80
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 21 160

  - [5, 1, Partial_conv3_DWCWTC, [256, 2, 'split_cat']]  #22 160
  - [[-2, -1], 1, Concat, [1]]  # 23 160
  - [-1, 3, RepC3, [256, 0.5]]    # 24 160

  - [-1, 1, Conv, [256, 3, 2]]   # 25 80
  - [[-1, 19], 1, Concat, [1]]  # 26  80
  - [-1, 3, RepC3, [256, 0.5]]    # 27 80

  - [-1, 1, Conv, [256, 3, 2]]   # 28 40
  - [[-1, 15], 1, Concat, [1]]  #29 40
  - [-1, 3, RepC3, [256, 0.5]]    #30 40

  - [-1, 1, Conv, [256, 3, 2]]   # 31 20
  - [[-1, 10], 1, Concat, [1]]  # 32 20
  - [-1, 3, RepC3, [256, 0.5]]    # 33 20

  - [[24, 27, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
