## Ultralytics YOLO 🚀, AGPL-3.0 license
## YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
#
## Parameters
#nc: 10 # number of classes
#scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#  # [depth, width, max_channels]
#  #n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
#  #s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
#  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
#  #l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
#  #x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
#
## YOLOv8.0n backbone
#backbone:
#  # [from, repeats, module, args]
#  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
#  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
#  - [-1, 3, C2f, [128, True]]  # 2
#  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
#  - [-1, 6, C2f, [256, True]]  # 4
#  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
#  - [-1, 6, C2f, [512, True]]  # 6
#  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
#  - [-1, 3, C2f, [1024, True]]  # 8
#  - [-1, 1, HV_Swin_Vit, [1024, 2]]  # 9
#  - [-1, 1, SPPF, [1024, 5]] # 10
#
## YOLOv8.0n head
#head:
#  - [[-1, 8], 1, Concat, [1]] # cat backbone P4  /32
#  - [-1, 3, C2f_HV_Swin_VIT, [512, 2]] # 13
#  - [-1, 1, CBAM, [512]]
#
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # / 16
#  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
#  - [-1, 2, C2f_HV_Swin_VIT, [256, 2]] # 17
#  - [-1, 1, CBAM, [256]]
#
#  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # / 8
#  - [[-1, 4], 1, Concat, [1]] # cat head P4
#  - [-1, 2, C2f_HV_Swin_VIT, [256, 2]] # 21 (P4/16-medium)
#  - [-1, 1, CBAM, [512]]
#
#  - [ -1, 1, Conv, [ 256, 3, 2 ] ]    # / 26      / 16
#  - [ [ -1, 16 ], 1, Concat, [ 1 ] ] # cat head P4
#  - [ -1, 2, C2f_HV_Swin_VIT, [ 512, 2 ] ] # 21
#  - [ -1, 1, CBAM, [ 384 ] ]
#
#  - [ -1, 1, Conv, [ 256, 3, 2 ] ]    # / 26      / 32
#  - [ [ -1, 12 ], 1, Concat, [ 1 ] ] # cat head P4
#  - [ -1, 2, C2f_HV_Swin_VIT, [ 512, 2 ] ] # 21
#  - [ -1, 1, CBAM, [ 512 ] ]
#
#  - [-1, 1, Conv, [512, 3, 1]]
#  - [[-1, 10], 1, Concat, [1]] # cat head P5
#  - [-1, 2, C2f_HV_Swin_VIT, [1024, 2]] # 25 (P5/32-large)
#
#  - [[20, 24, 28, 32], 1, Detect, [nc]] # Detect(P3, P4, P5)

# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 8 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  #n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  #s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  #l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  #x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  #0   /2
  - [-1, 1, Conv, [128, 3, 2]]  #1   /4
  - [-1, 3, C2f, [128, True]]  #2
  - [-1, 1, Conv, [256, 3, 2]] #3   /8
  - [-1, 6, C2f, [256, True]]  #4
  - [-1, 1, Conv, [512, 3, 2]] #5    /16
  - [-1, 6, C2f, [512, True]]#6
  - [ -1, 1, Conv, [ 768, 3, 2 ] ] #7    /32
  - [ -1, 6, C2f, [ 768, True ] ]#8
  - [-1, 1, Conv, [1024, 3, 2]] #9   /64
  - [-1, 3, C2f, [1024, True]] #10
  - [-1, 1, HV_Swin_Vit, [1024, 2]]  #11
  - [-1, 1, SPPF, [1024, 5]] #12

# YOLOv8.0n head
head:
  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]# 13   /32
  - [[-1, 8], 1, Concat, [1]] #14
  - [-1, 3, C2f_HV_Swin_VIT, [512, 2]] # 15
  - [-1, 1, CBAM, [512]]# 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #17   /16
  - [[-1, 6], 1, Concat, [1]] #18
  - [-1, 2, C2f_HV_Swin_VIT, [256, 2]] # 19
  - [-1, 1, CBAM, [256]] # 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #21   /8
  - [[-1, 4], 1, Concat, [1]] # 22
  - [-1, 2, C2f_HV_Swin_VIT, [256, 2]] # 23
  - [-1, 1, CBAM, [512]] #24

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]# 25  / 16
  - [ [ -1, 19 ], 1, Concat, [ 1 ] ] # 26
  - [ -1, 2, C2f_HV_Swin_VIT, [ 512, 2 ] ] # 27
  - [ -1, 1, CBAM, [ 384 ] ] # 28

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 29   / 32
  - [ [ -1, 15 ], 1, Concat, [ 1 ] ] # 30
  - [ -1, 2, C2f_HV_Swin_VIT, [ 512, 2 ] ]#31
  - [ -1, 1, CBAM, [ 512 ] ]#32

  - [-1, 1, Conv, [512, 3, 2]]#33  / 64
  - [10, 1, Conv, [512, 1, 1]]
  - [[-1, -2], 1, Concat, [1]] # 34
  - [-1, 2, C2f_HV_Swin_VIT, [1024, 2]] # 35

  - [[23, 27, 31, 35], 1, Detect, [nc]] # Detect(P3, P4, P5)
